cf_billing/AccumulationRegisters/энргКоличествоДнейИспользованияУслугиПриОтключении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргКоличествоДнейИспользованияУслугиПриОтключении</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргКоличествоДнейИспользованияУслугиПриОтключении/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура КоличествоДнейИспользованияУслугПриВременномОтключении(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "")  Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	КонецЕсли;
		
	Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));		
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаКоличествоДнейИспользованияУслугПриОтсутствии());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ЕстьОтборПоКлючамПомещений") И ПараметрыОтбора.ЕстьОтборПоКлючамПомещений Тогда
		НовыйИсточник 			= ОператорВыбора.Источники.Добавить("ЗначенияКлючейПомещений", "энргКлючиПомещений");
		
		СоотвествиеУсловий	= Новый Соответствие;
		СоотвествиеУсловий.Вставить("Помещение", "Помещение");
		СоотвествиеУсловий.Вставить("Строение", "Строение");
		МассивУсловий		= Новый Массив;
		МассивУсловий.Добавить(Новый Структура("ТипУсловия,СоотвествиеУсловий","ТипУсловияРавно", СоотвествиеУсловий));
		
		энргФормированиеТекстовЗапроса.УстановитьИсточникЗапроса(ОператорВыбора.Источники[0], НовыйИсточник, ТипСоединенияСхемыЗапроса.Внутреннее, МассивУсловий);  
		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "ПериодНачисления, Организация, Район, ЧастныйСектор, Строение, Помещение";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, "энргКоличествоДнейИспользованияУслугиПриОтключении", ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля 				= "Период,Регистратор,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 					= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

Процедура КоличествоДнейИспользованияУслугПриВременномОтключенииКоллекцияПериодов(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "")  Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	КонецЕсли;
		
	Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));		
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаКоличествоДнейИспользованияУслугПриОтсутствииКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
		
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "ПериодНачисления, Организация, Район, ЧастныйСектор, Строение, Помещение";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, "энргКоличествоДнейИспользованияУслугиПриОтключении", ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля 				= "Период,Регистратор,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 					= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ТекстЗапросаКоличествоДнейИспользованияУслугПриОтсутствии() Экспорт 
	
	Текст  =
	"ВЫБРАТЬ
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.ПериодНачисления КАК ПериодНачисления,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Организация КАК Организация,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Район КАК Район,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.ЧастныйСектор КАК ЧастныйСектор,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Строение КАК Строение,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Помещение КАК Помещение,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Количество КАК Количество,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Услуга КАК Услуга
	|ИЗ
	|	РегистрНакопления.энргКоличествоДнейИспользованияУслугиПриОтключении КАК энргКоличествоДнейИспользованияУслугиПриОтключении";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаКоличествоДнейИспользованияУслугПриОтсутствииКоллекцияПериодов() Экспорт 
	
	Текст  =
	"ВЫБРАТЬ
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Организация КАК Организация,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Район КАК Район,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.ЧастныйСектор КАК ЧастныйСектор,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Строение КАК Строение,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Помещение КАК Помещение,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.энргКоличествоДнейИспользованияУслугиПриОтключении КАК энргКоличествоДнейИспользованияУслугиПриОтключении
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			энргКоличествоДнейИспользованияУслугиПриОтключении.ПериодНачисления КАК ПериодНачисления,
	|			энргКоличествоДнейИспользованияУслугиПриОтключении.Организация КАК Организация,
	|			энргКоличествоДнейИспользованияУслугиПриОтключении.Район КАК Район,
	|			энргКоличествоДнейИспользованияУслугиПриОтключении.ЧастныйСектор КАК ЧастныйСектор,
	|			энргКоличествоДнейИспользованияУслугиПриОтключении.Строение КАК Строение,
	|			энргКоличествоДнейИспользованияУслугиПриОтключении.Помещение КАК Помещение,
	|			энргКоличествоДнейИспользованияУслугиПриОтключении.Количество КАК Количество,
	|			энргКоличествоДнейИспользованияУслугиПриОтключении.Период КАК Период,
	|			энргКоличествоДнейИспользованияУслугиПриОтключении.Услуга КАК Услуга
	|		ИЗ
	|			РегистрНакопления.энргКоличествоДнейИспользованияУслугиПриОтключении КАК энргКоличествоДнейИспользованияУслугиПриОтключении
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|				ПО энргКоличествоДнейИспользованияУслугиПриОтключении.Организация = ТаблицаПериодов.Организация
	|					И энргКоличествоДнейИспользованияУслугиПриОтключении.Район = ТаблицаПериодов.Район
	|					И энргКоличествоДнейИспользованияУслугиПриОтключении.Период < ТаблицаПериодов.ЗавершениеОП
	|					И энргКоличествоДнейИспользованияУслугиПриОтключении.Период >= ТаблицаПериодов.НачалоОП) КАК ВложенныйЗапрос
	|		ПО энргКоличествоДнейИспользованияУслугиПриОтключении.Период = ВложенныйЗапрос.Период
	|			И энргКоличествоДнейИспользованияУслугиПриОтключении.Организация = ВложенныйЗапрос.Организация
	|			И энргКоличествоДнейИспользованияУслугиПриОтключении.Район = ВложенныйЗапрос.Район
	|			И энргКоличествоДнейИспользованияУслугиПриОтключении.ЧастныйСектор = ВложенныйЗапрос.ЧастныйСектор
	|			И энргКоличествоДнейИспользованияУслугиПриОтключении.Строение = ВложенныйЗапрос.Строение
	|			И энргКоличествоДнейИспользованияУслугиПриОтключении.Помещение = ВложенныйЗапрос.Помещение
	|			И энргКоличествоДнейИспользованияУслугиПриОтключении.Услуга = ВложенныйЗапрос.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Организация,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Район,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.ЧастныйСектор,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Строение,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Помещение,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Услуга,
	|	ВложенныйЗапрос.ПериодНачисления";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
